import lib
import var


id_of_licence__ = ['''Загальні положення щодо ліцензування

Відповідно до ст. 91 ЦКУ юридична особа може здійснювати окремі види діяльності тільки після отримання спеціального дозволу (ліцензії).

Ліцензія — це документ державного зразка, який засвідчує право ліцензіата на проведення зазначеного в ліцензії виду господарської діяльності протягом певного терміну за умови дотримання ліцензійних умов (ст. 1  Про ліцензування певних видів господарської діяльності).

Форма бланка ліцензії затверджена постановою КМУ від 20.11.2000 р. № 1719. Перелік видів господарської діяльності, що підлягають ліцензуванню, визначений у ст. 9 Закону про ліцензування. Даний перелік є вичерпним, тобто не зазначені в ньому види господарський діяльності ліцензуванню не підлягають. Виняток становлять види діяльності, не зазначені в ст. 9, але передбачені ч. 2 ст. 2 Закону про ліцензування, а саме: 

·   Банківська діяльність; 

·   Професійна діяльність на ринку цінних паперів; 

·   Діяльність з надання фінансових послуг; 

·   Зовнішньоекономічна діяльність; 

·   Діяльність в галузі телебачення і радіомовлення; 

·   Діяльність у сфері електроенергетики та використання ядерної енергії; 

·   Освітня діяльність; 

·   Діяльність у сфері інтелектуальної власності; 

·   Виробництво і торгівля спиртом етиловим, коньячним і плодовим, алкогольними напоями та тютюновими виробами; 

·   Діяльність у сфері телекомунікацій; 

·   Будівництво.

Зазначені види діяльності підлягають ліцензуванню за правилами і відповідно до законів, що регулюють відносини у цих сферах.,''',

'''
Органи ліцензування та ліцензійні умови

Органом ліцензування є орган виконавчої влади, визначений КМУ, або спеціально уповноважений виконавчий орган місцевих рад для ліцензування окремих видів господарської діяльності (ст. 1 Про ліцензування певних видів господарської діяльності).В Україні немає єдиного державного органу ліцензування, що видає ліцензії на всі види діяльності. Ліцензії видаються різними вищими або місцевими органами виконавчої влади, перелік яких визначений КМУ. Якщо ліцензію на будь-який вид діяльності може видавати як вищий, так і місцевий орган виконавчої влади, то вважається, що на підставі ліцензії, виданої центральним органом, господарська діяльність може здійснюватися на всій території України, а на підставі ліцензії, виданої місцевим органом,— на території відповідної адміністративно-територіальної одиниці. Органами ліцензування розробляються спеціальні регуляторні акти — ліцензійні умови, в яких встановлюються кваліфікаційні, організаційні, технологічні та інші вимоги, дотримання яких необхідно для здійснення певного виду господарської діяльності (ст. 8 Закону про ліцензування). У ліцензійних умовах можуть встановлюватися вимоги до освіти і спеціальних знань співробітників ліцензіата, особливі вимоги до приміщень, обладнання, інших технічних засобів, що застосовуються в ліцензійній діяльності, і т. п. Діяльність суб'єкта господарювання, який отримав ліцензію, має проводитися в точній відповідності з встановленими для цього виду ліцензійними умовами.

Порядок одержання ліцензії

Для отримання ліцензії суб'єкт господарювання повинен особисто чи через уповноважену особу звернутися до відповідного органу ліцензування із заявою встановленого зразка (ст. 10 Про ліцензування певних видів господарської діяльності). Заява про видачу ліцензії повинно містити наступні дані: 

·   Відомості про суб'єкта господарювання — заявника (найменування, місцезнаходження, ідентифікаційний код, банківські реквізити юридичної особи; П. І. Б., паспортні дані, ідентифікаційний номер фізичної особи); 

·   Вид господарської діяльності у відповідності зі ст. 9 Закону про ліцензування, на здійснення якої заявник хоче отримати ліцензію.
''']

file = lib.CSV_exporter("Licence.csv", [
    "text" 
])
for i in range(id_of_licence__):
    file.writeRecord([
        i
    ])